# Практическое задание 1

Тема 3. Базовые алгоритмические структуры
## Задание 1.1
Вычислить значение функции y по заданной формуле. Значения исходных данных x, a и b ввести с клавиатуры. Результат вывести на печать. Функция выбирается из таблицы 2.
Определить тип вычислительного процесса. Построить алгоритм в виде блок-схемы, используя стандартные средства Microsoft Word, написать программу на языке С++. Представить результаты вычислений по заранее подготовленному тесту.
Для отладки программы можно использовать онлайн-компилятор (например, С++ shell).
Из таблицы 1.1 выбрать номер варианта (по первой букве фамилии). Из таблицы 1.2 выбирается задание.
## Задание 1.2
Составить программу по заданию, согласно варианту.
Определить тип вычислительного процесса. Построить алгоритм в виде блок-схемы, используя стандартные средства Microsoft Word, написать программу на языке С++.
Для отладки программы можно использовать онлайн-компилятор (например, С++ shell).
Представить результаты вычислений по заранее подготовленному тесту, проверить все возможные «ветви» алгоритма задачи.
Из таблицы 1.1 выбрать номер варианта (по первой букве фамилии). Из таблицы 1.3 выбирается задание.
## Задание 1.3
Задана функция f(x). В равностоящих точках вычислить значения функции f(x). Аргумент меняется в диапазоне:
a ≤ x ≤ b.
Границы интервала a, b и количество точек n ввести с клавиатуры. 
Определить тип вычислительного процесса. Построить алгоритм в виде блок-схемы, используя стандартные средства Microsoft Word, написать программу на языке С++. Представить результаты вычислений по заранее подготовленному тесту.
Для отладки программы можно использовать онлайн-компилятор (например, С++ shell).
Из таблицы 1.1 выбрать номер варианта (по первой букве фамилии). Из таблицы 1.4 выбирается задание.
Три выполненные задания сохранить в одном файле с именем Фамилия_задание_1.docx.	


## My Assgnments
> Мой вариант 
>       pow(a,(b+1))
> - y = (a + b)*pow(a,(b+1))  + tg(x);
> - Даны три действительных числа a, b и c. Возвести в квадрат те из них, значения которых неотрицательны
> - f(x) = 1 + sin(2πx)
Подсчитать сумму тех значений функции, дробная часть
которых < 0.5


    Вариант 	Функция
    1	y =  1/sin⁡〖(x)〗  + a^b √b
    2	y = (a + 1/(cos⁡〖(x〗)) ) ln(a + 1) – √b
    3	y = e^b+ (a +  1/sin⁡〖(x)〗 ) √(a+b)
    4	y = ln(b) (a +  1/(〖sin(〗⁡x))) – 1/e^(-b) 
    5	y = (a + b) a^(b+1)  + tg(x)
    6	y = tg(x) ((a+b))/√b
    7	y = 1/(〖cos(〗⁡x)) ln (b + a) (a + b)
    8	y = 1/(〖sin(〗⁡x))  e^(-b) + ln(a + b)
    9	y = sin(x) a^(b+1) + ln(a)
    10	y = (b + a/(〖cos(〗⁡x))) √(a+b) + e^(-b)

Таблица 1.3
Таблица вариантов задания 1.2 
Вариант 	Задание
1	Задана точка с координатами x и y (x*y ≠ 0). Определить номер четверти, в которой находится точка с указанными координатами. Присвоить переменной k номер этой четверти
2	Ввести с клавиатуры три действительных числа. Если сумма чисел меньше единицы, то меньшее из первых двух чисел заменить их средним значением, и все числа уменьшить в 5 раз, если это не так
3	Ввести с клавиатуры три целых числа. Определить, какие из них принадлежат интервалу от 1 до 10. О каждом числе выдать информацию на экран, принадлежит оно заданному интервалу или нет
4	Найти наименьшее из четырех заданных действительных чисел a, b, c и d
5	Даны три действительных числа a, b и c. Возвести в квадрат те из них, значения которых неотрицательны 
6	Определить, что больше: сумма или произведение трех действительных чисел. Числа ввести с клавиатуры
7	Поменять местами значения целых переменных a, b и c таким образом, чтобы a > b > c, то есть расположились в порядке убывания. Известно, что числа не равны между собой
8	Ввести с клавиатуры два целых числа. Наименьшее их них обнулить, а в случае их равенства – обнулить оба числа
9	Ввести с клавиатуры три действительных числа. Если сумма трех чисел меньше единицы, то наименьшее из них заменить полусуммой двух других, в противном случае удвоить все три числа
10	Ввести с клавиатуры три действительных числа. Если сумма трех чисел меньше единицы, то наименьшее из них обнулить, в противном случае уменьшить все числа в 2 раза 

Таблица 1.4
Таблица вариантов задания 1.3 
Вариант 	Задание

    1	f(x) = (1 – e^(-x)) cos(x)

Подсчитать сумму положительных значений функции 

    2	f(x) = 4 cos(2x) e^(-0.5x)
Подсчитать сумму отрицательных значений функции

    3	f(x) = 5 sin(πx) e^(-0.5x) 
Подсчитать произведение отрицательных значений функции

    4	f(x) = (1 – e^x) sin(4πx)
Подсчитать произведение положительных значений функции

    5	f(x) = 1 + sin(2πx)
Подсчитать сумму тех значений функции, дробная часть
которых < 0.5

    6	f(x) = 4 cos(πx) e^(-0.5x)
Найти произведение отрицательных значений 

    7	f(x) = 5 sin(2πx) e^(-0.5x)  
Найти произведение положительных значений 

    8	f(x) = (1 – e^x) sin(4πx)
Подсчитать сумму тех значений функции, дробная часть
которых < 0.8

    9	f(x) = 1 + sin⁡(2x)/(1+x)
Вычислить среднее арифметическое значений функции

    10	f(x) = (1 + 〖sin⁡(4x))/(1+x)〗^2
Найти сумму значений функции, дробная часть которых > 0.5 


Образец выполнения задания 1.1
Вычислить значение функции y по формуле:

    y = (a + b)1/(sin⁡(x)) ln(b).
Значения исходных данных x, a и b ввести с клавиатуры. Результат вывести на печать.
	Тип вычислительного процесса данной задачи – «следование».
	Блок-схема















	Код программы
    #include<iostream>
    #include<math.h>
    using namespace std;
    int main()
    {
        double x, a, b, y;
        cout << "\n Введите x, a, b "<<endl;
        cin >> x>>a>>b;                               // ввод исходных данных
        y = (a + b) / sin(x) * log(b);
        cout << "\n y="<<y<<endl;               // вывод результата

        system("pause");  
        return 0; }

