# My Assgnments
> Мой вариант 
>       pow(a,(b+1))
> - (1.1)  y = (a + b)*pow(a,(b+1))  + tg(x);
> - (1.2) Даны три действительных числа a, b и c. Возвести в квадрат те из них, значения которых неотрицательны
> - (1.3) f(x) = 1 + sin(2πx)
Подсчитать сумму тех значений функции, дробная часть
которых < 0.5


## Задание 1.1
Вычислить значение функции y по заданной формуле. Значения исходных данных x, a и b ввести с клавиатуры. Результат вывести на печать. Функция выбирается из таблицы 2.
Определить тип вычислительного процесса. Построить алгоритм в виде блок-схемы, используя стандартные средства Microsoft Word, написать программу на языке С++. Представить результаты вычислений по заранее подготовленному тесту.
Для отладки программы можно использовать онлайн-компилятор (например, С++ shell).


    #include <iostream>
    #include <math.h>
    #include <clocale>
    using namespace std;
    int main()
    {
        setlocale(LC_CTYPE, "rus");
        double x, a, b, y;
        cout << "\n Введите x, a, b " << endl;
        cin >> x >> a >> b;                               // ввод исходных данных
        y = (a + b) * pow(a, (b + 1)) + tan(x);
        cout << "\n y=" << y << endl;               // вывод результата

        system("pause");
        return 0;
    }

@@ _Контрольные мероприятия\решения\mail\Суворин_задание_1.docx